

// 姓名 手机 $emit 方式改写  删掉缓存17




// 安卓手机获取设备信息失败

// 安卓手机获取设备信息显示

// index 去维修按钮 获取颜色失败

// 首页机型识别问题 

// 首页tab UI调整  

// 首页评论UI 添加维修项目17


// 首页选择故障 五个快捷入口 先选择故障，然后跳转选择机型和颜色；17

// 下单页面


// 修改密码封装样式更改 18


// 首页服务区按钮 跳转  保养服务17


// 用户订单信息验证  验证码获取18

// index 附近商家 UI调整20

// s上传商家图片 showloading18


故障 颜色选取 showtoast


// 会员页面在navigateback 之后要强制刷新

// 会员接口对接 

// 手机会员和平板会员状态同时存在20

商家入口 -个人中心-总收益 总价计算修改模式

// 首页个人中心按钮 锁定读取数据 防止多次数据加载20



支付接口待完成

// index 强制 onload 刷新 :放到onshow中执行func 20


// 商家入驻 提交按钮 position：fixed

// 机型列表本机置顶 

showloading功能?


// 上门维修 会员价格计算修改

// 到店维修会员价格计算


// 商家注册上传证明接口调整

// 个人中心获取用户会员状态 {
// 	将授权button放到个人中心内部，获取授权放到内部onload判定
// 	index 个人中心button获取 openid

// }


// index成为会员button 更改组件 20

// 选择颜色 下一步button 更改组件 20





// 附近商家功能

// isvip 接口调整 添加superiorId  20


// index vip naviTo 20


多选id问题



华为手机index自动获取型号适配问题

// 商家二维码 20

页面分享设置


// 个人二维码


商家详情 调整


// 用户余额 


// 商家入驻： 上门维修、到店维修  多选



// 登录授权按钮跳转调整

// 获取用户openid失败问题

 // https://api.weixin.qq.com 域名添加信任

 二维码页面保存问题

// 会员页面banner 高度问题


 // 获取用户余额


// 首页最上方图标轮播


// 首页地图无法移动


// vip隐藏


// prize 1-7 随机数

主页提示商家入口位置  要求： 气泡类轻提示


11号完成

15号上线




// 首页授权之后跳转问题


// 首页 按钮 角度

服务区 更多服务

// 故障问题和服务区的距离

地图固定问题？

评论内容文案？

// 商家入驻  选择照片或者拍照  下方按钮距离问题

















已封装组件： {
	输入框  xlist-input,
	滚动选择器 xlist-picker
}





