多选id问题


// 姓名 手机 $emit 方式改写  删掉缓存17




// 安卓手机获取设备信息失败

// 安卓手机获取设备信息显示

// index 去维修按钮 获取颜色失败

// 首页机型识别问题 

// 首页tab UI调整  

// 首页评论UI 添加维修项目17

华为手机index自动获取型号适配问题

// 首页选择故障 五个快捷入口 先选择故障，然后跳转选择机型和颜色；17

// 下单页面


// 修改密码封装样式更改 18


// 首页服务区按钮 跳转  保养服务17


// 用户订单信息验证  验证码获取18


// s上传商家图片 showloading18


故障 颜色选取 showtoast


// 会员页面在navigateback 之后要强制刷新

// 会员接口对接 

手机会员和平板会员状态同时存在

商家入口 -个人中心-总收益 总价计算修改模式

首页个人中心按钮 锁定读取数据 防止多次数据加载



支付接口待完成

index 强制 onload 刷新 :放到onshow中执行func


商家入驻 提交按钮 position：fixed

机型列表本机置顶 

showloading功能?





已封装组件： {
	输入框  xlist-input,
	滚动选择器 xlist-picker
}